{
  "content": "# Cloud Database Service Level Agreement\n\n## 1. Service Commitment\n\nCloud Database Services is committed to providing a service with a Monthly Uptime Percentage of at least 99.99% during any monthly billing cycle (the \"Service Commitment\"). Subject to the terms and conditions of this SLA, if Cloud Database Services does not meet the Service Commitment, you will be eligible to receive a Service Credit.\n\n## 2. Definitions\n\n- **Monthly Uptime Percentage** is calculated by subtracting from 100% the percentage of minutes during the month in which the service was in a state of \"Unavailable\".\n- **Unavailable** means that all connection requests to the running database instances fail during a 1-minute interval.\n- **Service Credit** is a dollar credit, calculated as set forth below, that we may credit back to an eligible account.\n\n## 3. Service Credits\n\nService Credits are calculated as a percentage of the total charges paid by you for the applicable service for the billing cycle in which the Monthly Uptime Percentage fell within the ranges set forth below:\n\n- Less than 99.99% but equal to or greater than 99.0% - 10% credit\n- Less than 99.0% but equal to or greater than 95.0% - 25% credit\n- Less than 95.0% - 100% credit\n\n## 4. Performance Metrics\n\n### 4.1 Database Response Time\n\nThe database will maintain a query response time of less than 100ms for at least 99% of requests under standard workloads.\n\n### 4.2 Backup and Recovery\n\n- Automated daily backups with retention for 35 days\n- Point-in-time recovery capabilities for up to 7 days\n- Recovery Time Objective (RTO): 1 hour\n- Recovery Point Objective (RPO): 5 minutes\n\n### 4.3 Scaling Capabilities\n\n- Automatic scaling up to 2x baseline capacity within 10 minutes\n- Ability to scale storage up to 64TB\n\n## 5. Support Response Times\n\n- Critical Issues (P1): Response within 15 minutes, 24x7\n- High-Priority Issues (P2): Response within 1 hour, 24x7\n- Normal-Priority Issues (P3): Response within 4 hours during business hours\n- Low-Priority Issues (P4): Response within 8 business hours\n\n## 6. Security Commitments\n\n- Encryption at rest using AES-256\n- Encryption in transit using TLS 1.2 or higher\n- Automated security patches applied within 24 hours of release\n- Regular vulnerability assessments\n- Compliance with SOC 2, ISO 27001, and GDPR requirements\n\n## 7. Monitoring and Reporting\n\n- Real-time monitoring dashboard\n- Monthly service reports\n- Incident notifications within 15 minutes\n- Scheduled maintenance notifications at least 7 days in advance\n\n## 8. Disaster Recovery\n\n- Multi-region replication options\n- Automated failover with RPO of 5 minutes\n- Regular disaster recovery testing every quarter\n\n## 9. Service Request Management\n\n- 99.9% of service requests will be acknowledged within the specified response time\n- 95% of service requests will be resolved within the agreed resolution time\n\n## 10. Exclusions\n\nThe Service Commitment does not apply to any unavailability, suspension or termination of Cloud Database Services performance issues:\n\n1. That result from a suspension\n2. Caused by factors outside of our reasonable control\n3. That result from any actions or inactions of you or any third party\n4. That result from your equipment, software or other technology\n5. Arising from our suspension or termination of your right to use Cloud Database Services in accordance with our terms\n\n## 11. Service Credit Request\n\nTo receive a Service Credit, you must submit a claim by opening a case in the Support Center. To be eligible, the credit request must be received by us by the end of the second billing cycle after which the incident occurred.",
  "metadata": {
    "industry": "it_services",
    "service_type": "cloud_database",
    "title": "Cloud Database Service Level Agreement",
    "compliance_frameworks": ["SOC2", "ISO27001", "GDPR"]
  }
}